#+OPTIONS: toc:nil todo:nil
#+PROPERTY: header-args:jupyter-python :session py 

* Solving the Problem

First, we find a solution to the problem
#+begin_src jupyter-python
from  scipy.optimize import linprog as lp
import numpy as np

tol = 1e-6 # Numbers in solution smaller than this (in absolute value) treated as zeros

# Now solve problem!  (Note that the linear program solver we'll use assumes
# "less-than-or-equal" constraints.  We can switch back and forth by
# multiplying $A$ and $b$ by $-1$.)

result = lp(p, -A, -b, method='highs')

result
#+end_src

Let's interpret this.  Start with the cost of the solution:
#+begin_src jupyter-python

print(f"Cost of diet for {group} is ${result.fun:.2f} per day.")
#+end_src


Next, what is it we're actually eating?

#+begin_src jupyter-python
# lets mess with the p index so they are recipe names not ids.
p = p.to_frame()
p = p.merge(food_names, how="left", left_index=True, right_index=True).set_index("recipe")

# Put back into nice series
diet = pd.Series(result.x,index=p.index)

print("\nYou'll be eating (in 100s of grams or milliliters):")
print(diet[diet >= tol])
#+end_src

Given this diet, what are nutritional outcomes?
#+begin_src jupyter-python

tab = pd.DataFrame({"Outcome":A.to_numpy()@diet.to_numpy(),"Recommendation":np.abs(b)})
print("\nWith the following nutritional outcomes of interest:")
tab
#+end_src


Finally, what are the constraints that bind?  Finding a less expensive
diet might involve finding less expensive sources for these particular nutrients.
#+begin_src jupyter-python

print("\nConstraining nutrients are:")
excess = tab.diff(axis=1).iloc[:,1]
print(excess.loc[np.abs(excess) < tol].index.tolist())

#+end_src
Lets merge these 

,#+begin_src jupyter-python
# normalize weights to percentage terms. 
recipes['ingred_wt'] = recipes['ingred_wt']/recipes.groupby(['parent_foodcode'])['ingred_wt'].transform("sum")

# get nutrients per 100g recipe.
df = recipes.merge(nutrition, how="left", on="ingred_code")

# multiply all nutrients per 100g of an ingredient by the weight of that ingredient in a recipe. 
df.iloc[:, 6:] = df.iloc[:, 6:].multiply(df['ingred_wt'], axis=0)

# sum nutrients of food codes (over the multiple ingredients)
df = df.groupby('parent_foodcode').sum()
print(df.head())
#+end_src

#+RESULTS:
#+begin_example
recipe_id
11000000                                          Milk, human
11100000                                            Milk, NFS
11111000                                          Milk, whole
11111100                              Milk, low sodium, whole
11111150                       Milk, calcium fortified, whole
                                  ...                        
99997802    Tomatoes as ingredient in omeletTomatoes as in...
99997804    Other vegetables as ingredient in omeletOther ...
99997810    Vegetables as ingredient in curryVegetables as...
99998130    Sauce as ingredient in hamburgersSauce as ingr...
99998210    Industrial oil as ingredient in foodIndustrial...
Name: recipe, Length: 8899, dtype: object
                                    parent_desc ingred_code  \
parent_foodcode                                               
11000000                            Milk, human        1107   
11100000                              Milk, NFS        1111   
11111000                            Milk, whole        1077   
11111100                Milk, low sodium, whole        1089   
11111150         Milk, calcium fortified, whole        1077   

                                                      ingred_desc  ingred_wt  \
parent_foodcode                                                                
11000000                               Milk, human, mature, fluid        1.0   
11100000           Milk, averaged fat, with added vitamin A and D        1.0   
11111000         Milk, whole, 3.25% milkfat, with added vitamin D        1.0   
11111100                                  Milk, low sodium, fluid        1.0   
11111150         Milk, whole, 3.25% milkfat, with added vitamin D        1.0   

                                           Ingredient description  \
parent_foodcode                                                     
11000000                               Milk, human, mature, fluid   
11100000           Milk, averaged fat, with added vitamin A and D   
11111000         Milk, whole, 3.25% milkfat, with added vitamin D   
11111100                                  Milk, low sodium, fluid   
11111150         Milk, whole, 3.25% milkfat, with added vitamin D   

                 Capric acid  Lauric acid  Myristic acid  Palmitic acid  \
parent_foodcode                                                           
11000000             0.06300       0.2560        0.32100        0.91900   
11100000             0.03825       0.0405        0.14275        0.42475   
11111000             0.07500       0.0770        0.29700        0.82900   
11111100             0.08700       0.0970        0.34800        0.91000   
11111150             0.07500       0.0770        0.29700        0.82900   

                 Palmitoleic acid  ...  Vitamin B12  Vitamin B-12, added  \
parent_foodcode                    ...                                     
11000000                  0.12900  ...       0.0500                  0.0   
11100000                  0.01175  ...       0.4875                  0.0   
11111000                  0.00000  ...       0.4500                  0.0   
11111100                  0.07700  ...       0.3600                  0.0   
11111150                  0.00000  ...       0.4500                  0.0   

                 Vitamin B6  Vitamin C  Vitamin D  Vitamin E  \
parent_foodcode                                                
11000000              0.011       5.00      0.100       0.08   
11100000              0.037       0.05      1.225       0.03   
11111000              0.036       0.00      1.300       0.07   
11111100              0.034       0.90      1.300       0.08   
11111150              0.036       0.00      1.300       0.07   

                 Vitamin E, added  Vitamin K   Water    Zinc  
parent_foodcode                                               
11000000                      0.0       0.30  87.500  0.1700  
11100000                      0.0       0.15  89.525  0.4225  
11111000                      0.0       0.30  88.130  0.3700  
11111100                      0.0       0.30  88.200  0.3800  
11111150                      0.0       0.30  88.130  0.3700  

[5 rows x 70 columns]
#+end_example
